# Proposal

## Title: 

### Introduction

Data science and STEM careers are growing in popularity as more businesses leverage technological advances to solve challenges and streamline operations. Among them, students who are waiting for employment or employees who want to change careers are very curious about what can be the mean factors that impact the tracjectory of salaries and bonuses among the top 5 companies counts from our data. The purpose of the experiment was to determine the most relevant predictors from the data set to relate to the potential impact on a person's career in STEM and data science. This is to suggest that the job seekers can be more insightful and intentional with their development and career path. The dataset we will be working with is the "Data Science and STEM Salary" dataset from Kaggle, which contains information on numerous job titles and other criteria, and has 62,000 salary records from the leading organizations for this project.

### Preliminary exploratory data analysis

In [3]:
library(repr)
library(tidyverse)
library(tidymodels)
options(repr.matrix.max.rows = 6)

In [4]:
salary_data <- read_csv("data/Levels_Fyi_Salary_Data.csv")

Rows: 62642 Columns: 29
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (10): timestamp, company, level, title, location, tag, gender, otherdeta...
dbl (19): totalyearlycompensation, yearsofexperience, yearsatcompany, basesa...

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [5]:
top_5_company_count <- salary_data |> group_by(company) |> summarize(count=n()) |> arrange(desc(count)) |> head(5)
top_5_company_count

  company   count
1 Amazon    8126
2 Microsoft 5216
3 Google    4330
4 Facebook  2990
5 Apple     2028

In [6]:
all_role_title <- salary_data |> group_by(title) |> summarize(count=n())
all_role_title

   title                        count
1  Business Analyst              885
2  Data Scientist               2578
3  Hardware Engineer            2200
⋮  ⋮                            ⋮
13 Software Engineering Manager 3569
14 Solution Architect           1157
15 Technical Program Manager    1381

In [7]:
all_location <- salary_data |> group_by(location) |> summarize(count=n())
all_location

     location                    count
1    Aachen, NW, Germany         3
2    Aarhus, AR, Denmark         5
3    Aberdeen Proving Ground, MD 1
⋮    ⋮                           ⋮
1048 Zaragoza, AR, Spain           3
1049 Zug, ZG, Switzerland          1
1050 Zurich, ZH, Switzerland     172

In [8]:
all_tags <- salary_data |> group_by(tag) |> summarize(count=n())
all_tags

     tag       count
1    --        5
2    ??        2
3    .NET      1
⋮    ⋮         ⋮
3060 YouTube     1
3061 Z Systems   1
3062 NA        808

### Method

Work experience, Gender, Base Salary, and Bonus are the quantitative variables that we will use to predict the categorical variable Company. Initially, we'll use a filter to remove all rows containing NA and zeros, then we'll select the necessary four predictors and a predictor column. The data is then divided into training and testing sets. The training set is used to create recipes and fit models, while the test set is used to predict outcomes and determine accuracy and workflow analysis. At the same time, we will visualize the prediction results and the accuracy vs k of each predictor variable combination to better compare the prediction effect and accuracy.

### Expected outcomes and significance
- What do you expect to find?
In this project, we are expecting to find the most relavent perdictors that can impact the trajectory of compensation. 
This can vary from the years of experience to the role titles.
- What impact could such findings have?
The impact is impactful to the job market and the trajectory of the career path for the people who are currently searching for jobs and people who are interested in learning more about their career development. Those perdictors can be something to consider, when they are researching for opportunities. 
- What future questions could this lead to?
As our dataset is not fully complete - some variables have high percentage of N/A, it will be helpful to refresh the survey in the near future to get more information. This can provide us with a clear understanding and stengthen the correlation of the variables.

Can you predict role title based on one's experience?
For example: A person have 5 years of work exp. So this person is an engineer?

What if we predict compensation based on:
- yearsofexperience
- location
- role title
- yearsatcompany
- basesalary
- 

The point is, the only code we have to put is the code for cleaning and wrangling

RQ: Which predictor is the most impactful to predict the yearly compensation?
1. Filter out the column with no data or no way to quantify, example: gender, observation class, etc.
- Comment by a pessimistic: why do we not just filter out the NA instead of exclude the column?
2. Use all the remaining predictors to do a forward selection (as in 6.8.3)
3. Finally, make and tune a model to classify yearly compensation (?)
- At this point, since we know which predictors are relevant and which is not, we can just predict role title, and the question at the beginning will be nullified